Animation_For_SciTech2016/case1/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    // coordinates of the outer domain
    (-15.4969 0.30805 0)
    (-0.24896 15.2561 0)
    (0.5 15.2561 0)
    (30.5 15.2561 0)
    (30.5 -6.8289e-18 0)
    (30.5 -14.943 0)
    (0.5 -14.943 0)
    (-0.24896 -14.943 0)
    // Airfoil key coordinates
    (-0.5 0.0050717 0)
    (-0.24896 0.070164 0)
    (0.5 -6.8289e-18 0)
    (-0.24896 -0.070164 0)
    // ************************************************ // 
    // coordinates of the outer domain
    (-15.4969 0.30805 1)
    (-0.24896 15.2561 1)
    (0.5 15.2561 1)
    (30.5 15.2561 1)
    (30.5 -6.8289e-18 1)
    (30.5 -14.943 1)
    (0.5 -14.943 1)
    (-0.24896 -14.943 1)
    // Airfoil key coordinates
    (-0.5 0.0050717 1)
    (-0.24896 0.070164 1)
    (0.5 -6.8289e-18 1)
    (-0.24896 -0.070164 1)
);

blocks
(
    hex (8 9 1 0 20 21 13 12) (40 100 1) simpleGrading (1 50 1)
    hex (9 10 2 1 21 22 14 13) (40 100 1) simpleGrading (1 50 1)
    hex (10 4 3 2 22 16 15 14) (200 100 1) simpleGrading (20 50 1)
    
    hex (11 8 0 7 23 20 12 19) (40 100 1) simpleGrading (1 50 1)
    hex (10 11 7 6 22 23 19 18) (60 100 1) simpleGrading (1 50 1)
    hex (4 10 6 5 16 22 18 17) (200 100 1) simpleGrading (0.05 50 1)
);

edges
(
    // Arc for the front
    arc 0 1 (-10.0521 11.991 0)
    arc 12 13 (-10.0521 11.991 1)
    arc 0 7 (-11.9319 -9.4951 0)
    arc 12 19 (-11.9319 -9.4951 1)
    // Define airfoil top-front surface // 
    spline 8 9
    (
        (-0.4951 0.015107 0)
        (-0.48534 0.02482 0)
        (-0.47078 0.034006 0)
        (-0.45156 0.042471 0)
        (-0.4278 0.050041 0)
        (-0.39971 0.056564 0)
        (-0.3675 0.061915 0)
        (-0.33143 0.065999 0)
        (-0.29181 0.068757 0)
    )
    spline 20 21
    (
        (-0.4951 0.015107 1)
        (-0.48534 0.02482 1)
        (-0.47078 0.034006 1)
        (-0.45156 0.042471 1)
        (-0.4278 0.050041 1)
        (-0.39971 0.056564 1)
        (-0.3675 0.061915 1)
        (-0.33143 0.065999 1)
        (-0.29181 0.068757 1)
    )
    // Define airfoil top-back surface // 
    spline 9 10
    (
        (-0.20325 0.070236 0)
        (-0.15509 0.069026 0)
        (-0.10493 0.066623 0)
        (-0.05324 0.063154 0)
        (-0.00054687 0.058779 0)
        (0.052599 0.053682 0)
        (0.10561 0.048069 0)
        (0.15786 0.042155 0)
        (0.20872 0.036159 0)
        (0.25751 0.030289 0)
        (0.30355 0.02473 0)
        (0.34618 0.019639 0)
        (0.38473 0.015127 0)
        (0.41858 0.011257 0)
        (0.44715 0.0080368 0)
        (0.46994 0.00542 0)
        (0.48653 0.0033081 0)
        (0.49662 0.0015592 0)
    )
    spline 21 22
    (
        (-0.20325 0.070236 1)
        (-0.15509 0.069026 1)
        (-0.10493 0.066623 1)
        (-0.05324 0.063154 1)
        (-0.00054687 0.058779 1)
        (0.052599 0.053682 1)
        (0.10561 0.048069 1)
        (0.15786 0.042155 1)
        (0.20872 0.036159 1)
        (0.25751 0.030289 1)
        (0.30355 0.02473 1)
        (0.34618 0.019639 1)
        (0.38473 0.015127 1)
        (0.41858 0.011257 1)
        (0.44715 0.0080368 1)
        (0.46994 0.00542 1)
        (0.48653 0.0033081 1)
        (0.49662 0.0015592 1)
    )
    // Define airfoil bottom-front surface // 
    spline 8 11
    (
        (-0.4951 -0.015107 0)
        (-0.48534 -0.02482 0)
        (-0.47078 -0.034006 0)
        (-0.45156 -0.042471 0)
        (-0.4278 -0.050041 0)
        (-0.39971 -0.056564 0)
        (-0.3675 -0.061915 0)
        (-0.33143 -0.065999 0)
        (-0.29181 -0.068757 0)
    )
    spline 20 23
    (
        (-0.4951 -0.015107 1)
        (-0.48534 -0.02482 1)
        (-0.47078 -0.034006 1)
        (-0.45156 -0.042471 1)
        (-0.4278 -0.050041 1)
        (-0.39971 -0.056564 1)
        (-0.3675 -0.061915 1)
        (-0.33143 -0.065999 1)
        (-0.29181 -0.068757 1)
    )
    // Define airfoil bottom-back surface // 
    spline 11 10
    (
        (-0.20325 -0.070236 0)
        (-0.15509 -0.069026 0)
        (-0.10493 -0.066623 0)
        (-0.05324 -0.063154 0)
        (-0.00054687 -0.058779 0)
        (0.052599 -0.053682 0)
        (0.10561 -0.048069 0)
        (0.15786 -0.042155 0)
        (0.20872 -0.036159 0)
        (0.25751 -0.030289 0)
        (0.30355 -0.02473 0)
        (0.34618 -0.019639 0)
        (0.38473 -0.015127 0)
        (0.41858 -0.011257 0)
        (0.44715 -0.0080368 0)
        (0.46994 -0.00542 0)
        (0.48653 -0.0033081 0)
        (0.49662 -0.0015592 0)
    )
    spline 23 22
    (
        (-0.20325 -0.070236 1)
        (-0.15509 -0.069026 1)
        (-0.10493 -0.066623 1)
        (-0.05324 -0.063154 1)
        (-0.00054687 -0.058779 1)
        (0.052599 -0.053682 1)
        (0.10561 -0.048069 1)
        (0.15786 -0.042155 1)
        (0.20872 -0.036159 1)
        (0.25751 -0.030289 1)
        (0.30355 -0.02473 1)
        (0.34618 -0.019639 1)
        (0.38473 -0.015127 1)
        (0.41858 -0.011257 1)
        (0.44715 -0.0080368 1)
        (0.46994 -0.00542 1)
        (0.48653 -0.0033081 1)
        (0.49662 -0.0015592 1)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
            (0 7 19 12)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (3 4 16 15)
            (4 5 17 16)
        );
    }
    
    airfoil
    {
        type wall;
        faces
        (
            (8 9 21 20)
            (9 10 22 21)
            (8 11 23 20)
            (11 10 22 23)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (1 2 14 13)
            (2 3 15 14)
            (7 6 18 19)
            (6 5 17 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
